# 딕셔너리 : key와 value 쌍으로 구성, {키 : 값}

dic1 = {1 : 'a', 2 : 'b', 3 : 'c'}
print(dic1[1])  # a
print(dic1[2])  # b
print(dic1[3])  # c

student1 = {'학번' : 1000, '이름' : '홍길동', '학과' : '컴퓨터학과'} # 키와 값의 타입은 일치하지 않아도 됨
print(student1)
# 딕셔너리에 값 추가
student1['연락처'] = '010-1234-5678' # {'학번': 1000, '이름': '홍길동', '학과': '컴퓨터학과'}
print(student1) # {'학번': 1000, '이름': '홍길동', '학과': '컴퓨터학과', '연락처': '010-1234-5678'}

# 딕셔너리의 값 수정
student1['학과'] = '파이썬학과'
print(student1) # {'학번': 1000, '이름': '홍길동', '학과': '파이썬학과', '연락처': '010-1234-5678'}
del(student1['학과'])
print(student1) # {'학번': 1000, '이름': '홍길동', '연락처': '010-1234-5678'}


print(student1.get('학번')) # 1000
print(student1.get('학과')) # None : del(~)로 삭제했으므로 데이터 없음
print(student1.keys()) # 키만 리턴 / dict_keys(['학번', '이름', '연락처'])